# GROUP DISCUSSION

In [120]:
##import lib, set pandas display

#import pandas
import pandas as pd

# set display format float
pd.options.display.float_format = "{:,.2f}".format

## Latihan List Comprehension

**Latihan :**

1. Menggunakan list comprehension dan fungsi range() buat list yang berisi angka 1 hingga 100
    <br/><br/>
    
2. Ubah pernyataan dibawah ini menjadi list comprehension
```python
list_a = [3,9,27,81,243]
list_b = []
for value in list_a:
    list_b.append(value/3)
list_b
```

3. Ubah pernyataan dibawah ini menjadi list comprehension
```python
list_1 = [x for x in range(100)]
list_2 = []
for value in list_1:
    if value < 25:
        list_2.append(value * 2)
list_2
```

## Jawaban List Comprehension

### Jawaban soal 1

In [121]:
#Jawaban soal 1
list_saya=[]
for i in range(1,100,1):
    list_saya.append(i)
print(list_saya)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [122]:
range_2 = range(1,100,1)
list1 = list(range_2)
print(list1)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

### Jawaban soal 2

In [123]:
#Jawaban Soal 2
list_a = [3,9,27,81,243]
list_b = []
for value in list_a:
    list_b.append(value/3)
list_b

[1.0, 3.0, 9.0, 27.0, 81.0]

### Jawaban soal 3

In [124]:
#Jawaban Soal 3
list_1 = [x for x in range(100)]
list_2 = []
for value in list_1:
    if value < 25:
        list_2.append(value * 2)
print(list_2)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48]

## Latihan .loc dan .iloc

> **Dengan menggunakan data weather**

In [125]:
# data weather
df_lat = pd.read_csv("https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/data_weather.csv")
# df_lat = pd.read_csv("dataset/raw/data_weather.csv")
df_lat = df_lat.set_index('Day')
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

**Latihan :**

1. Latihan 1
    - dengan .loc dan .iloc (keduanya)
    - ambil row ke 2 sampai dengan row ke 5 (bukan index)
    - dari kolom Weather, Wind, Humidity <br/><br/>
    
2. Latihan 2
    - Tampilkan Dataframe
    - dengan .loc ambil weather hari Jumat
    - dengan .iloc ambil semua data dari Selasa sampai dengan Kamis

## Jawaban .loc dan .iloc

### Jawaban 1

In [126]:
# ambil row ke 2 sampai dengan row ke 5 (bukan index) dari kolom Weather, Wind, Humidity
# menggunakan loc
df_lat.loc['Tue':'Sat',['Weather','Wind','Humidity']] # dengan loc

    Weather  Wind  Humidity
Day
Tue   Sunny    28        96
Wed   Sunny    16        20
Thu  Cloudy    11        22
Fri  Shower    26        79
Sat  Shower    27        62

In [127]:
# menggunakan iloc
df_lat.iloc[1:6,[0,2,3]] # dengan iloc

    Weather  Wind  Humidity
Day
Tue   Sunny    28        96
Wed   Sunny    16        20
Thu  Cloudy    11        22
Fri  Shower    26        79
Sat  Shower    27        62

### Jawaban 2

In [128]:

# Tampilkan Dataframe
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

In [129]:
# mengambil weather hari Jumat menggunakan loc
df_friday = df_lat.loc['Fri':'Fri',['Weather']]
df_friday

    Weather
Day
Fri  Shower

In [130]:
# mengambil semua data dengan .iloc dari Selasa sampai dengan Kamis
df2 = df_lat.iloc[1:4,]
df2

    Weather  Temperature  Wind  Humidity
Day
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22

## Latihan Filtering Data

> **Dengan menggunakan data weather**

In [131]:
# data weather
df_lat = pd.read_csv("https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/data_weather.csv")
# df_lat = pd.read_csv("dataset/raw/data_weather.csv")
df_lat = df_lat.set_index('Day')
df_lat

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Thu  Cloudy        14.44    11        22
Fri  Shower        10.51    26        79
Sat  Shower        11.07    27        62
Sun   Sunny        17.50    20        10

**Latihan :**

1. Latihan 1
   - dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny <br/><br/>

2. Latihan 2
   - dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny dan wind <= 20

## Jawaban Filtering Data

### Jawaban 1

In [132]:
# dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny
df_lat[df_lat['Weather'] == 'Sunny']

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Tue   Sunny        19.67    28        96
Wed   Sunny        17.51    16        20
Sun   Sunny        17.50    20        10

### Jawaban 2

In [133]:
# dengan menggunakan conditional (cara apa saja), tampilkan baris dengan weather sunny dan wind <= 20
df_lat[(df_lat['Weather'] == 'Sunny') & (df_lat['Wind'] <= 20)]

    Weather  Temperature  Wind  Humidity
Day
Mon   Sunny        12.79    13        30
Wed   Sunny        17.51    16        20
Sun   Sunny        17.50    20        10

## Latihan Lambda

> **Dengan menggunakan data nilai**

In [134]:
## data nilai

# initializing a list
values= [['Reza',90,90],['Rizky',100,90],['Pratama',100,80],
         ['Ade',95,85],['Satya',100,95],['Wahana',90,85]]

# creating pandas dataframe
df_lambda = pd.DataFrame(values, columns=['Name','Nilai_Mtk','Nilai_Fisika'])
df_lambda

      Name  Nilai_Mtk  Nilai_Fisika
0     Reza         90            90
1    Rizky        100            90
2  Pratama        100            80
3      Ade         95            85
4    Satya        100            95
5   Wahana         90            85

Latihan lambda :
- menggunakan .apply()
- karena semua murid mencontek (kecuali ade) maka "Nilai_Mtk" selain ade dikurangi 10
- karena jujur murid bernama "Ade" maka "Nilai_Mtk" ditambah 5

## Jawaban Lambda

In [135]:
#jawaban lambda :

df_lambda['Nilai_Mtk'] = df_lambda.apply(lambda x : x['Nilai_Mtk'] + 5 if x['Name']=='Ade' else x['Nilai_Mtk']-10, axis=1)
df_lambda
# ini menunjukkan salah satu fungsi dari df.copy() => df asal tetap

      Name  Nilai_Mtk  Nilai_Fisika
0     Reza         80            90
1    Rizky         90            90
2  Pratama         90            80
3      Ade        100            85
4    Satya         90            95
5   Wahana         80            85

## Latihan Akhir

> **Dengan menggunakan data sales**

In [136]:
# Data Sales
df = pd.read_csv('https://raw.githubusercontent.com/CRMDSDIP/PJJDAS_IV/main/Data_Preparation/day1/dataset/raw/sales_data_latihan.csv')
# df = pd.read_csv("dataset/raw/sales_data_latihan.csv")
df

,Customer Number,Customer Name,Address,Type,Sales,Percent Growth
0,100025,Quest Industry,"Kebayoran Lama, Jakarta",Company,Rp162500000,30.00%
1,552278,Smith Plumbing,"Pasteur, Bandung",Company,Rp101200000,10.00%
2,234775,ACME Industrial,"Kebayoran Lama, Jakarta",Perusahaan,62500000,NaN
3,249000,Brekke LTD,"Pasteur, Bandung",Company,4900000,4.00%
4,651029,Harbor Co,"Cilincing, Jakarta",Company,Rp12750000,-15.00%
5,565600,Berkah Jaya,"Antapani, Bandung",Perusahaan,Rp762500000,30.00%
6,897440,Rafee Ahmad,"Sawangan, Depok",Personal,"Rp12,200,000.00",10.00%
7,123156,Reza Pratama,"Kebayoran Baru, Jakarta",Personal,50000000,25
8,138135,PT Berdikari,"Kebayoran Lama, Jakarta",Perusahaan,Rp9000000,4.00%
9,748952,Alexander Samiun,"Sleman, Jogjakarta",Individu,127450000,-15.00%

Latihan Akhir : 
1. Perbaiki format data:
- Kolom sales seharusnya numerik (hapus Rp)
- Kolom "Percent Growth" seharusnya numerik (tanpa tanda %) dan isi NaN (Null) dengan nilai Rata-rata (Mean)
- Hilangkan spasi berlebih pada kolom Type 
<br/><br/>
2. Buat laporan:
- Jumlah Sales Berdasarkan Tipe
- Ambil 3 "Customer Name" dengan kenaikan tertinggi

## Jawaban Akhir :

### Jawaban 1 :

In [137]:
# Cek data types
df.dtypes

Customer Number     int64
Customer Name      object
Address            object
Type               object
Sales              object
Percent Growth     object
dtype: object

#### Sales

In [138]:
# menghilangkan notasi mata uang dari data
df['Sales'] = df['Sales'].str.replace('Rp|Rp.|IDR','', regex=True)

In [139]:
# menghilangkan thousand separator berupa koma
df['Sales'] = df['Sales'].str.replace(',','', regex=True)

In [140]:
# mengubah tipe data menjadi float
df['Sales'] = df['Sales'].astype(float)

In [141]:
# tipe data kolom Sales setelah di-transform
df['Sales'].dtypes

dtype('float64')

#### Percent Growth

In [142]:
# menghilangkan karakter '%' dari data
df['Percent Growth'] = df['Percent Growth'].str.replace('%','', regex=False)

In [143]:
# mengubah tipe data menjadi float
df['Percent Growth'] = df['Percent Growth'].astype(float)

In [144]:
# tipe data kolom Percent Growth setelah di-transform
df['Percent Growth'].dtypes

dtype('float64')

In [145]:
# memeriksa apakah ada missing values pada Percent Growth
df['Percent Growth'].isna().sum() #ada 1 record yang berisi missing values

1

In [146]:
# melakukan imputasi missing value menggunakan nilai rata-rata kolom tersebut
df["Percent Growth"].fillna(df["Percent Growth"].mean(), inplace=True)

In [147]:
# hasil imputasi
df

,Customer Number,Customer Name,Address,Type,Sales,Percent Growth
0,100025,Quest Industry,"Kebayoran Lama, Jakarta",Company,"162,500,000.00",30.00
1,552278,Smith Plumbing,"Pasteur, Bandung",Company,"101,200,000.00",10.00
2,234775,ACME Industrial,"Kebayoran Lama, Jakarta",Perusahaan,"62,500,000.00",9.22
3,249000,Brekke LTD,"Pasteur, Bandung",Company,"4,900,000.00",4.00
4,651029,Harbor Co,"Cilincing, Jakarta",Company,"12,750,000.00",-15.00
5,565600,Berkah Jaya,"Antapani, Bandung",Perusahaan,"762,500,000.00",30.00
6,897440,Rafee Ahmad,"Sawangan, Depok",Personal,"12,200,000.00",10.00
7,123156,Reza Pratama,"Kebayoran Baru, Jakarta",Personal,"50,000,000.00",25.00
8,138135,PT Berdikari,"Kebayoran Lama, Jakarta",Perusahaan,"9,000,000.00",4.00
9,748952,Alexander Samiun,"Sleman, Jogjakarta",Individu,"127,450,000.00",-15.00

In [148]:
# missing value pada kolom Percent Growth setelah imputasi
df['Percent Growth'].isna().sum()

0

#### Type

In [149]:
# menghilangkan karakter whitespace
df["Type"] = df["Type"].apply(lambda x : x.strip())

In [150]:
# tipe data kolom Type setelah di-transform
df['Type'].dtypes

dtype('O')

### Jawaban 2 :

#### Laporan Sales berdasarkan Type

In [151]:
# duplikasi data frame
df_sales = df.copy()

In [152]:
# Melakukan group-by sales berdasarkan type perusahaan
df_sales_by_type = df_sales.groupby(by=['Type']).agg(['sum','count','mean'])
df_sales_by_type

C:\Users\aldip\AppData\Local\Temp\ipykernel_12344\876268251.py:2: FutureWarning: ['Customer Name', 'Address'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df_sales_by_type = df_sales.groupby(by=['Type']).agg(['sum','count','mean'])

           Customer Number                           Sales        \
                       sum count       mean            sum count
Type
Company            1552332     4 388,083.00 281,350,000.00     4
Individu            748952     1 748,952.00 127,450,000.00     1
Personal           1020596     2 510,298.00  62,200,000.00     2
Perusahaan          938510     3 312,836.67 834,000,000.00     3

                          Percent Growth
                     mean            sum count   mean
Type
Company     70,337,500.00          29.00     4   7.25
Individu   127,450,000.00         -15.00     1 -15.00
Personal    31,100,000.00          35.00     2  17.50
Perusahaan 278,000,000.00          43.22     3  14.41

In [153]:
# menampilkan hanya data penjualan saja

df_sales_by_type.iloc[:,3:6]

                    Sales
                      sum count           mean
Type
Company    281,350,000.00     4  70,337,500.00
Individu   127,450,000.00     1 127,450,000.00
Personal    62,200,000.00     2  31,100,000.00
Perusahaan 834,000,000.00     3 278,000,000.00

#### Top 3 Customer Berdasarkan Percent Growth Tertinggi

In [154]:
# melakukan sort data berdasarkan Percent Growth secara descending
df_best_growth = df.sort_values(by='Percent Growth', ascending=False)

In [155]:
# menampilkan 3 costumer dengan Percent Growth terbesar
df_best_growth.iloc[:3,]

,Customer Number,Customer Name,Address,Type,Sales,Percent Growth
0,100025,Quest Industry,"Kebayoran Lama, Jakarta",Company,"162,500,000.00",30.00
5,565600,Berkah Jaya,"Antapani, Bandung",Perusahaan,"762,500,000.00",30.00
7,123156,Reza Pratama,"Kebayoran Baru, Jakarta",Personal,"50,000,000.00",25.00

In [156]:
print(df_best_growth.iloc[:3,1])

0    Quest Industry
5       Berkah Jaya
7      Reza Pratama
Name: Customer Name, dtype: object